app/Http/Controllers/QuizController.php

    public function index(Module $module)
    {

        $questions = Quiz::with(['author','module'])->latest()->paginate(5);
---
select * from `modules` where `modules`.`id` in (4, 5, 6)